const coordinate = [
    {
        name : "Тегеран",
        address : "ITC SMART TEHRAN \n" +
            "Республика Иран, г. Тегеран. ул. Джомохри, Ислами, пересечение ул. Южный Эскандари №1578",
        one: "",
        two: "",
    },
    {
        name : "Москва",
        address: "ООО \"МТК СМАРТ МСК\"Российская Федерация, г. Москва, улица Талдомская, дом 2Г",
        one: "",
        two: "",
    },
    {
        name : "Краснодар",
        address: "ООО \"МАКС ЭКСПО\"Российская Федерация, Краснодарский край, М.Р-Н Славянский,Г.П. Славянское, г. Славянск - на - Кубани, ул. Стаханова. д. 197/1, офис 206",
        one: "",
        two: "",
    },
    {
        name : "Алматы",
        address: "ITC SMART TEHRAN \n" +
            "Республика Иран, г. Тегеран. ул. Джомохри, Ислами, пересечение ул. Южный Эскандари №1578",
        one: "",
        two: "",
    },
    {
        name : "Бишкек",
        address: "ОсОО “МТК СМАРТ”\n" +
            "Кыргызская Республика г. Бишкек ул. Тоголок Молдо 3Б",
        one: "",
        two: "",
    },

];
export default coordinate